In [178]:
# Created CSV file based on assignment example
# Then I reorganized the cells to remove NaNs. Cleaning it up to handle the data better.

import pandas as pd

Location = r'~/Documents/airport_info.csv'
new_header=["Alaska On Time", "Alaska Delayed", "AM West On Time", "AM West Delayed"]

df = pd.read_csv(Location)
df = df.T
df = df.rename(columns={0:"Alaska On Time", 1:"Alaska Delayed", 3:"AM West On Time", 4:"AM West Delayed"})
df = df.dropna(thresh=2, axis='columns')
df = df.drop(['Unnamed: 0', 'Unnamed: 1'])
df

              Alaska On Time Alaska Delayed AM West On Time AM West Delayed
Los Angeles              497             62             694             117
Phoenix                  221             12            4840             415
San Diego                212             20             383              65
San Francisco            503            102             320             129
Seattle                 1841            305             201              61

In [173]:
# I converted the numbers to a percentage. Taking the sum of 'on time' and 'delayed'
# I then divided that by just the delayed flights. Multiplying the return by 100. Below are the results.

df['Total Alaska'] = df['Alaska On Time'] + df['Alaska Delayed']
df['% of Alaska Delay'] = (df['Alaska Delayed'] / df['Total Alaska']) * 100
df['% of Alaska Delay']

Los Angeles      11.0912
Phoenix          5.15021
San Diego        8.62069
San Francisco    16.8595
Seattle          14.2125
Name: % of Alaska Delay, dtype: object

In [165]:
# I converted the numbers to a percentage. Taking the sum of 'on time' and 'delayed'
# I then divided that by just the delayed flights. Multiplying the return by 100. Below are the results.

df['Total AM West'] = df['AM West On Time'] + df['AM West Delayed']
df['% of AM West Delay'] = (df['AM West Delayed'] / df['Total AM West']) * 100
df['% of AM West Delay']

Los Angeles      14.4266
Phoenix          7.89724
San Diego        14.5089
San Francisco    28.7305
Seattle          23.2824
Name: Percentage of AM West Delay, dtype: object

In [177]:
# Comparing the arrival delays for the two airlines. We are now able to see that AM West Airlines
# has the most delays

df[['% of AM West Delay', '% of Alaska Delay']]

              % of AM West Delay % of Alaska Delay
Los Angeles              14.4266           11.0912
Phoenix                  7.89724           5.15021
San Diego                14.5089           8.62069
San Francisco            28.7305           16.8595
Seattle                  23.2824           14.2125